In [1]:
import pandas as pd
import numpy as np

In [2]:
dataset = pd.read_csv("/home/yadhu/MEGA/ML TUTORIALS/BASICS/DUPLICATES/sample.csv")

In [5]:
dataset.head()

     name  gender  mark
0  adarsh    male    50
1   henry    male    45
2     joe    male    42
3     adi    male    35
4    ammu  female    48

In [6]:
dataset.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9      True
10     True
11     True
dtype: bool

In [7]:
dataset.duplicated().sum()

4

In [8]:
dataset.drop_duplicates(inplace=True)

In [9]:
dataset

     name  gender  mark
0  adarsh    male    50
1   henry    male    45
2     joe    male    42
3     adi    male    35
4    ammu  female    48
5    devi  female    50
6    sita  female    24
7  anjana  female    19

In [10]:
dataset.duplicated().sum()

0